Autodesk.Revit.DB.Visibility
Describes the visibility of a particular geometry object.

Autodesk.Revit.DB.Visibility.Invisible
The geometry object is never visible. This type of geometry is never returned by
Autodesk.Revit.DB.Element.Geometry(Autodesk.Revit.DB.Options) but may be obtained by other
API operations.

Autodesk.Revit.DB.Visibility.Contextual
The geometry object is visible in some contexts, but not in others.  This type of geometry is always returned by
Autodesk.Revit.DB.Element.Geometry(Autodesk.Revit.DB.Options),
even when Revit is in a context where the geometry should not be visible, but only if
Autodesk.Revit.DB.Options.IncludeNonVisibleObjects is true.
Examples of geometry of this class include Solids representing insulation and lining for MEP ducts and pipes.

Autodesk.Revit.DB.Visibility.Highlight
The geometry object is visible, but is affected by highlight or prehighlight special coloration.
This type of geometry is returned by Autodesk.Revit.DB.Element.Geometry(Autodesk.Revit.DB.Options)
if Autodesk.Revit.DB.Options.IncludeNonVisibleObjects is true.

Autodesk.Revit.DB.Visibility.Visible
The geometry object is always visible. This type of geometry is always returned by
Autodesk.Revit.DB.Element.Geometry(Autodesk.Revit.DB.Options)